taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_K10_DFP.1.2.1.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>Kinetis_K10_DFP</name>
  <description>NXP Kinetis K10 Series Device Support</description>

  <releases>
    <release version="1.2.1" date="2017-02-16">
      Updated device header files: added ARM Clang 6 directives for handling anonymous unions
    </release>
    <release version="1.2.0" date="2016-10-04">
      Updated CMSIS-Device files:
       - startup files and system_MK10D7.c
      Updated device vendor from Freescale to NXP
      Updated documentation
    </release>
    <release version="1.1.0" date="2014-07-24">
      Added basic device support for MK11DX128Axxx5, MK11DX256Axxx5, MK11DN512Axxx5 devices.
    </release>
    <release version="1.0.0">
      First Release version of K10 Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>K10</keyword>
  </keywords>

  <devices>

    <family Dfamily="K10 Series" Dvendor="NXP:11">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1"/>
      <book name="Documents/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>

        <description>
The Kinetis K1x MCU family consists of general-purpose MCUs with a variety of memory and integration options.
Devices start from 32 KB of flash in a small footprint of 5x5 mm 32 QFN package extending up to 1 MB in a 144 MAPBGA package with an optional rich suite of analog, communication, timing and control peripherals.
Additionally, its pin compatibility, flexible low-power capabilities and innovative FlexMemory help to solve many of the major pain points for embedded designers.
Next-generation Kinetis K1x MCUs are further optimized for performance and power consumption and offer more streamlined integration for further BOM cost reductions.
         </description>

      <!-- ******************************  MK10DN128xxx5  ****************************** -->
      <device Dname="MK10DN128xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK10D5.h" define="MK10DN128xxx5"/>
        <debug svd="SVD/MK10D5.svd"/>
        <memory id="IROM1"                        start="0x00000000" size="0x00020000" startup="1" default="1"/>
        <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
        <memory id="IRAM2"                        start="0x1FFFE000" size="0x00002000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P128_50MHZ.FLM" start="0x00000000" size="0x00020000"             default="1"/>

        <book name="Documents/K10P64M50SF0RM.pdf" title="MK10DN128xxx5 Reference Manual"/>
        <book name="Documents/K10P64M50SF0.pdf"   title="MK10DN128xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK10DN32xxx5  ****************************** -->
      <device Dname="MK10DN32xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK10D5.h"  define="MK10DN32xxx5"/>
        <debug svd="SVD/MK10D5.svd"/>
        <memory id="IROM1"                       start="0x00000000" size="0x00008000" startup="1" default="1"/>
        <memory id="IRAM1"                       start="0x20000000" size="0x00001000" init   ="0" default="1"/>
        <memory id="IRAM2"                       start="0x1FFFF000" size="0x00001000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P32_50MHZ.FLM" start="0x00000000" size="0x00008000"             default="1"/>

        <book name="Documents/K10P64M50SF0RM.pdf" title="MK10DN32xxx5 Reference Manual"/>
        <book name="Documents/K10P64M50SF0.pdf"   title="MK10DN32xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK10DN64xxx5  ****************************** -->
      <device Dname="MK10DN64xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK10D5.h" define="MK10DN64xxx5"/>
        <debug svd="SVD/MK10D5.svd"/>
        <memory id="IROM1"                       start="0x00000000" size="0x00010000" startup="1" default="1"/>
        <memory id="IRAM1"                       start="0x20000000" size="0x00002000" init   ="0" default="1"/>
        <memory id="IRAM2"                       start="0x1FFFE000" size="0x00002000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P64_50MHZ.FLM" start="0x00000000" size="0x00010000"             default="1"/>

        <book name="Documents/K10P64M50SF0RM.pdf" title="MK10DN64xxx5 Reference Manual"/>
        <book name="Documents/K10P64M50SF0.pdf"   title="MK10DN64xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK10DX128xxx5  ****************************** -->
      <device Dname="MK10DX128xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK10D5.h" define="MK10DX128xxx5"/>
        <debug svd="SVD/MK10D5.svd"/>
        <memory id="IROM1"                        start="0x00000000" size="0x00020000" startup="1" default="1"/>
        <memory id="IROM2"                        start="0x10000000" size="0x00008000" startup="0" default="0"/>
        <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
        <memory id="IRAM2"                        start="0x1FFFE000" size="0x00002000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P128_50MHZ.FLM" start="0x00000000" size="0x00020000"             default="1"/>
        <algorithm name="Flash/MK_D32_50MHZ.FLM"  start="0x10000000" size="0x00008000"             default="1"/>

        <book name="Documents/K10P64M50SF0RM.pdf" title="MK10DX128xxx5 Reference Manual"/>
        <book name="Documents/K10P64M50SF0.pdf"   title="MK10DX128xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK10DX32xxx5  ****************************** -->
      <device Dname="MK10DX32xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK10D5.h" define="MK10DX32xxx5"/>
        <debug svd="SVD/MK10D5.svd"/>
        <memory id="IROM1"                       start="0x00000000" size="0x00008000" startup="1" default="1"/>
        <memory id="IROM2"                       start="0x10000000" size="0x00008000" startup="0" default="0"/>
        <memory id="IRAM1"                       start="0x20000000" size="0x00001000" init   ="0" default="1"/>
        <memory id="IRAM2"                       start="0x1FFFF000" size="0x00001000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P32_50MHZ.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        <algorithm name="Flash/MK_D32_50MHZ.FLM" start="0x10000000" size="0x00008000"             default="1"/>

