taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_K10_DFP.1.2.1.pdsc
        <book name="Documents/K10P64M50SF0RM.pdf" title="MK10DX32xxx5 Reference Manual"/>
        <book name="Documents/K10P64M50SF0.pdf"   title="MK10DX32xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK10DX64xxx5  ****************************** -->
      <device Dname="MK10DX64xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK10D5.h" define="MK10DX64xxx5"/>
        <debug svd="SVD/MK10D5.svd"/>
        <memory id="IROM1"                       start="0x00000000" size="0x00010000" startup="1" default="1"/>
        <memory id="IROM2"                       start="0x10000000" size="0x00008000" startup="0" default="0"/>
        <memory id="IRAM1"                       start="0x20000000" size="0x00002000" init   ="0" default="1"/>
        <memory id="IRAM2"                       start="0x1FFFE000" size="0x00002000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P64_50MHZ.FLM" start="0x00000000" size="0x00010000"             default="1"/>
        <algorithm name="Flash/MK_D32_50MHZ.FLM" start="0x10000000" size="0x00008000"             default="1"/>

        <book name="Documents/K10P64M50SF0RM.pdf" title="MK10DX64xxx5 Reference Manual"/>
        <book name="Documents/K10P64M50SF0.pdf"   title="MK10DX64xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK10DX128xxx7  ****************************** -->
      <device Dname="MK10DX128xxx7">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MK10D7.h" define="MK10DX128xxx7"/>
        <debug svd="SVD/MK10D7.svd"/>
        <memory id="IROM1"                       start="0x00000000" size="0x00020000" startup="1" default="1"/>
        <memory id="IROM2"                       start="0x10000000" size="0x00008000" startup="0" default="0"/>
        <memory id="IRAM1"                       start="0x20000000" size="0x00004000" init   ="0" default="1"/>
        <memory id="IRAM2"                       start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P128.FLM"      start="0x00000000" size="0x00020000"             default="1"/>
        <algorithm name="Flash/MK_D32_72MHZ.FLM" start="0x10000000" size="0x00008000"             default="1"/>

        <book name="Documents/K10P100M72SF1RM.pdf" title="MK10DX128xxx7 Reference Manual"/>
        <book name="Documents/K10P100M72SF1.pdf"   title="MK10DX128xxx7 Data Sheet"/>
      </device>

      <!-- ******************************  MK10DX256xxx7  ****************************** -->
      <device Dname="MK10DX256xxx7">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MK10D7.h" define="MK10DX256xxx7"/>
        <debug svd="SVD/MK10D7.svd"/>
        <memory id="IROM1"                       start="0x00000000" size="0x00040000" startup="1" default="1"/>
        <memory id="IROM2"                       start="0x10000000" size="0x00008000" startup="0" default="0"/>
        <memory id="IRAM1"                       start="0x20000000" size="0x00008000" init   ="0" default="1"/>
        <memory id="IRAM2"                       start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P256.FLM"      start="0x00000000" size="0x00040000"             default="1"/>
        <algorithm name="Flash/MK_D32_72MHZ.FLM" start="0x10000000" size="0x00008000"             default="1"/>

        <book name="Documents/K10P100M72SF1RM.pdf" title="MK10DX256xxx7 Reference Manual"/>
        <book name="Documents/K10P100M72SF1.pdf"   title="MK10DX256xxx7 Data Sheet"/>
      </device>

      <!-- ******************************  MK10DX64xxx7  ****************************** -->
      <device Dname="MK10DX64xxx7">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MK10D7.h" define="MK10DX64xxx7"/>
        <debug svd="SVD/MK10D7.svd"/>
        <memory id="IROM1"                       start="0x00000000" size="0x00010000" startup="1" default="1"/>
        <memory id="IROM2"                       start="0x10000000" size="0x00008000" startup="0" default="0"/>
        <memory id="IRAM1"                       start="0x20000000" size="0x00002000" init   ="0" default="1"/>
        <memory id="IRAM2"                       start="0x1FFFE000" size="0x00002000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P64.FLM"       start="0x00000000" size="0x00010000"             default="1"/>
        <algorithm name="Flash/MK_D32_72MHZ.FLM" start="0x10000000" size="0x00008000"             default="1"/>

        <book name="Documents/K10P100M72SF1RM.pdf" title="MK10DX64xxx7 Reference Manual"/>
        <book name="Documents/K10P100M72SF1.pdf"   title="MK10DX64xxx7 Data Sheet"/>
      </device>

      <!-- ******************************  MK10DN512xxx10  ****************************** -->
      <device Dname="MK10DN512xxx10">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device/Include/MK10D10.h" define="MK10DN512xxx10"/>
        <debug svd="SVD/MK10D10.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00010000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

        <book name="Documents/K10P144M100SF2V2RM.pdf" title="MK10DN512xxx10 Reference Manual"/>
        <book name="Documents/K10P144M100SF2V2.pdf"   title="MK10DN512xxx10 Data Sheet"/>
      </device>

      <!-- ******************************  MK10DX128xxx10  ****************************** -->
      <device Dname="MK10DX128xxx10">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device/Include/MK10D10.h" define="MK10DX128xxx10"/>
        <debug svd="SVD/MK10D10.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
        <memory id="IROM2"                  start="0x10000000" size="0x00020000" startup="0" default="0"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00004000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P128.FLM" start="0x00000000" size="0x00020000"             default="1"/>
        <algorithm name="Flash/MK_D128.FLM" start="0x10000000" size="0x00020000"             default="1"/>

