taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_K10_DFP.1.2.1.pdsc
        <book name="Documents/K10P144M100SF2V2RM.pdf" title="MK10DX128xxx10 Reference Manual"/>
        <book name="Documents/K10P144M100SF2V2.pdf"   title="MK10DX128xxx10 Data Sheet"/>
      </device>

      <!-- ******************************  MK10DX256xxx10  ****************************** -->
      <device Dname="MK10DX256xxx10">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device/Include/MK10D10.h" define="MK10DX256xxx10"/>
        <debug svd="SVD/MK10D10.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
        <memory id="IROM2"                  start="0x10000000" size="0x00040000" startup="0" default="0"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P256.FLM" start="0x00000000" size="0x00040000"             default="1"/>
        <algorithm name="Flash/MK_D256.FLM" start="0x10000000" size="0x00040000"             default="1"/>

        <book name="Documents/K10P144M100SF2V2RM.pdf" title="MK10DX256xxx10 Reference Manual"/>
        <book name="Documents/K10P144M100SF2V2.pdf"   title="MK10DX256xxx10 Data Sheet"/>
      </device>

      <!-- ******************************  MK10FN1M0xxx12  ****************************** -->
      <device Dname="MK10FN1M0xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device/Include/MK10F12.h" define="MK10FN1M0xxx12"/>
        <debug svd="SVD/MK10F12.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00010000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P1M0.FLM" start="0x00000000" size="0x00100000"             default="1"/>

        <book name="Documents/K10P144M120SF3RM.pdf" title="MK10FN1M0xxx12 Reference Manual"/>
        <book name="Documents/K10P144M120SF3.pdf"   title="MK10FN1M0xxx12 Data Sheet"/>
      </device>

      <!-- ******************************  MK10FX512xxx12  ****************************** -->
      <device Dname="MK10FX512xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device/Include/MK10F12.h" define="MK10FX512xxx12"/>
        <debug svd="SVD/MK10F12.svd"/>
        <memory id="IROM1"                   start="0x00000000" size="0x00080000" startup="1" default="1"/>
        <memory id="IROM2"                   start="0x10000000" size="0x00080000" startup="0" default="0"/>
        <memory id="IRAM1"                   start="0x20000000" size="0x00010000" init   ="0" default="1"/>
        <memory id="IRAM2"                   start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P512X.FLM" start="0x00000000" size="0x00080000"             default="1"/>
        <algorithm name="Flash/MK_D512.FLM"  start="0x10000000" size="0x00080000"             default="1"/>

        <book name="Documents/K10P144M120SF3RM.pdf" title="MK10FX512xxx12 Reference Manual"/>
        <book name="Documents/K10P144M120SF3.pdf"   title="MK10FX512xxx12 Data Sheet"/>
      </device>

      <!-- ******************************  MK11DN512xxx5  ****************************** -->
      <device Dname="MK11DN512xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK11D5.h" define="MK11DN512xxx5"/>
        <debug svd="SVD/MK11D5.svd"/>
        <memory id="IROM1"                        start="0x00000000" size="0x00080000" startup="1" default="1"/>
        <memory id="IRAM1"                        start="0x20000000" size="0x00008000" init   ="0" default="1"/>
        <memory id="IRAM2"                        start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P512_50MHZ.FLM" start="0x00000000" size="0x00080000"             default="1"/>

        <book name="Documents/K11P121M50SF4RM.pdf" title="MK11DN512xxx5 Reference Manual"/>
        <book name="Documents/K11P121M50SF4.pdf"   title="MK11DN512xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK11DX128xxx5  ****************************** -->
      <device Dname="MK11DX128xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK11D5.h" define="MK11DX128xxx5"/>
        <debug svd="SVD/MK11D5.svd"/>
        <memory id="IROM1"                        start="0x00000000" size="0x00020000" startup="1" default="1"/>
        <memory id="IROM2"                        start="0x10000000" size="0x00010000" startup="0" default="0"/>
        <memory id="IRAM1"                        start="0x20000000" size="0x00004000" init   ="0" default="1"/>
        <memory id="IRAM2"                        start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P128_50MHZ.FLM" start="0x00000000" size="0x00020000"             default="1"/>
        <algorithm name="Flash/MK_D64_50MHZ.FLM"  start="0x10000000" size="0x00010000"             default="1"/>

        <book name="Documents/K11P121M50SF4RM.pdf" title="MK11DX128xxx5 Reference Manual"/>
        <book name="Documents/K11P121M50SF4.pdf"   title="MK11DX128xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK11DX256xxx5  ****************************** -->
      <device Dname="MK11DX256xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK11D5.h" define="MK11DX256xxx5"/>
        <debug svd="SVD/MK11D5.svd"/>
        <memory id="IROM1"                        start="0x00000000" size="0x00040000" startup="1" default="1"/>
        <memory id="IROM2"                        start="0x10000000" size="0x00010000" startup="0" default="0"/>
        <memory id="IRAM1"                        start="0x20000000" size="0x00004000" init   ="0" default="1"/>
        <memory id="IRAM2"                        start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P256_50MHZ.FLM" start="0x00000000" size="0x00040000"             default="1"/>
        <algorithm name="Flash/MK_D64_50MHZ.FLM"  start="0x10000000" size="0x00010000"             default="1"/>

