taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_K10_DFP.1.2.1.pdsc
        <book name="Documents/K11P121M50SF4RM.pdf" title="MK11DX256xxx5 Reference Manual"/>
        <book name="Documents/K11P121M50SF4.pdf"  title="MK11DX256xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK11DX128Axxx5  ***************************** -->
      <device Dname="MK11DX128Axxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK11DA5.h" define="MK11DX128Axxx5"/>
        <debug svd="SVD/MK11DA5.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
        <memory id="IROM2"                  start="0x10000000" size="0x00010000" startup="0" default="0"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00004000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P128.FLM" start="0x00000000" size="0x00020000"             default="1"/>
        <algorithm name="Flash/MK_D64.FLM"  start="0x10000000" size="0x00010000"             default="1"/>

        <book name="Documents/K11P121M50SF4V2RM.pdf" title="MK11DX128Axxx5 Reference Manual"/>
        <book name="Documents/K11P121M50SF4V2.pdf"   title="MK11DX128Axxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK11DX256Axxx5  ***************************** -->
      <device Dname="MK11DX256Axxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK11DA5.h" define="MK11DX256Axxx5"/>
        <debug svd="SVD/MK11DA5.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
        <memory id="IROM2"                  start="0x10000000" size="0x00010000" startup="0" default="0"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00004000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P256.FLM" start="0x00000000" size="0x00040000"             default="1"/>
        <algorithm name="Flash/MK_D64.FLM"  start="0x10000000" size="0x00010000"             default="1"/>

        <book name="Documents/K11P121M50SF4V2RM.pdf" title="MK11DX256Axxx5 Reference Manual"/>
        <book name="Documents/K11P121M50SF4V2.pdf"   title="MK11DX256Axxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK11DN512Axxx5  ***************************** -->
      <device Dname="MK11DN512Axxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK11DA5.h" define="MK11DN512Axxx5"/>
        <debug svd="SVD/MK11DA5.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

        <book name="Documents/K11P121M50SF4V2RM.pdf" title="MK11DN512Axxx5 Reference Manual"/>
        <book name="Documents/K11P121M50SF4V2.pdf"   title="MK11DN512Axxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK12DN512xxx5  ****************************** -->
      <device Dname="MK12DN512xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK12D5.h" define="MK12DN512xxx5"/>
        <debug svd="SVD/MK12D5.svd"/>
        <memory id="IROM1"                        start="0x00000000" size="0x00080000" startup="1" default="1"/>
        <memory id="IRAM1"                        start="0x20000000" size="0x00008000" init   ="0" default="1"/>
        <memory id="IRAM2"                        start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P512_50MHZ.FLM" start="0x00000000" size="0x00080000"             default="1"/>

        <book name="Documents/K12P121M50SF4RM.pdf" title="MK12DN512xxx5 Reference Manual"/>
        <book name="Documents/K12P121M50SF4.pdf"   title="MK12DN512xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK12DX128xxx5  ****************************** -->
      <device Dname="MK12DX128xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK12D5.h" define="MK12DX128xxx5"/>
        <debug svd="SVD/MK12D5.svd"/>
        <memory id="IROM1"                        start="0x00000000" size="0x00020000" startup="1" default="1"/>
        <memory id="IROM2"                        start="0x10000000" size="0x00010000" startup="0" default="0"/>
        <memory id="IRAM1"                        start="0x20000000" size="0x00004000" init   ="0" default="1"/>
        <memory id="IRAM2"                        start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P128_50MHZ.FLM" start="0x00000000" size="0x00020000"             default="1"/>
        <algorithm name="Flash/MK_D64_50MHZ.FLM"  start="0x10000000" size="0x00010000"             default="1"/>

        <book name="Documents/K12P121M50SF4RM.pdf" title="MK12DX128xxx5 Reference Manual"/>
        <book name="Documents/K12P121M50SF4.pdf"   title="MK12DX128xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK12DX256xxx5  ****************************** -->
      <device Dname="MK12DX256xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK12D5.h" define="MK12DX256xxx5"/>
        <debug svd="SVD/MK12D5.svd"/>
        <memory id="IROM1"                        start="0x00000000" size="0x00040000" startup="1" default="1"/>
        <memory id="IROM2"                        start="0x10000000" size="0x00010000" startup="0" default="0"/>
        <memory id="IRAM1"                        start="0x20000000" size="0x00004000" init   ="0" default="1"/>
        <memory id="IRAM2"                        start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P256_50MHZ.FLM" start="0x00000000" size="0x00040000"             default="1"/>
        <algorithm name="Flash/MK_D64_50MHZ.FLM"  start="0x10000000" size="0x00010000"             default="1"/>

        <book name="Documents/K12P121M50SF4RM.pdf" title="MK12DX256xxx5 Reference Manual"/>
        <book name="Documents/K12P121M50SF4.pdf"   title="MK12DX256xxx5 Data Sheet"/>
      </device>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="K10D5">
      <description>NXP Kinetis K10D 50MHz devices</description>
      <require Dvendor="NXP:11"/>
      <accept Dname="MK10DN128xxx5"/>
      <accept Dname="MK10DN32xxx5"/>
      <accept Dname="MK10DN64xxx5"/>
      <accept Dname="MK10DX128xxx5"/>
      <accept Dname="MK10DX32xxx5"/>
      <accept Dname="MK10DX64xxx5"/>
    </condition>
