taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_K10_DFP.1.2.1.pdsc
    <condition id="K10D7">
      <description>NXP Kinetis K10D 72MHz devices</description>
      <require Dvendor="NXP:11"/>
      <accept Dname="MK10DX128xxx7"/>
      <accept Dname="MK10DX256xxx7"/>
      <accept Dname="MK10DX64xxx7"/>
    </condition>
    <condition id="K10D10">
      <description>NXP Kinetis K10D 100MHz devices</description>
      <require Dvendor="NXP:11"/>
      <accept Dname="MK10DN512xxx10"/>
      <accept Dname="MK10DX128xxx10"/>
      <accept Dname="MK10DX256xxx10"/>
    </condition>
    <condition id="K10F12">
      <description>NXP Kinetis K10F 120MHz devices</description>
      <require Dvendor="NXP:11"/>
      <accept Dname="MK10FN1M0xxx12"/>
      <accept Dname="MK10FX512xxx12"/>
    </condition>
    <condition id="K11D5">
      <description>NXP Kinetis K11D 50MHz devices</description>
      <require Dvendor="NXP:11"/>
      <accept Dname="MK11DN512xxx5"/>
      <accept Dname="MK11DX128xxx5"/>
      <accept Dname="MK11DX256xxx5"/>
    </condition>
    <condition id="K12D5">
      <description>NXP Kinetis K12D 50MHz devices</description>
      <require Dvendor="NXP:11"/>
      <accept Dname="MK12DN512xxx5"/>
      <accept Dname="MK12DX128xxx5"/>
      <accept Dname="MK12DX256xxx5"/>
    </condition>
    <condition id="K11DA5">
      <description>NXP Kinetis K11DA 50MHz devices</description>
      <require Dvendor="NXP:11" Dname="MK11D????Axxx5"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="K10D5 CMSIS">
      <description>NXP Kinetis K10 50MHz devices and CMSIS-CORE</description>
      <require condition="K10D5"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="K10D7 CMSIS">
      <description>NXP Kinetis K10D 72MHz devices and CMSIS-CORE</description>
      <require condition="K10D7"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="K10D10 CMSIS">
      <description>NXP Kinetis K10D 100MHz devices and CMSIS-CORE</description>
      <require condition="K10D10"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="K10F12 CMSIS">
      <description>NXP Kinetis K10F 120MHz devices and CMSIS-CORE</description>
      <require condition="K10F12"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="K11D5 CMSIS">
      <description>NXP Kinetis K11D 50MHz devices and CMSIS-CORE</description>
      <require condition="K11D5"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="K12D5 CMSIS">
      <description>NXP Kinetis K12D 50MHz devices and CMSIS-CORE</description>
      <require condition="K12D5"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="K11DA5 CMSIS">
      <description>NXP Kinetis K11DA 50MHz devices and CMSIS-CORE</description>
      <require condition="K11DA5"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

  </conditions>

  <components>

    <!-- Startup K10D5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="K10D5 CMSIS">
      <description>System Startup for NXP Kinetis K10D 50MHz devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source" name="Device/Source/ARM/startup_MK10D5.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MK10D5.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup K10D7 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="K10D7 CMSIS">
      <description>System Startup for NXP Kinetis K10D 72MHz devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source" name="Device/Source/ARM/startup_MK10D7.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MK10D7.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup K10D10 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="K10D10 CMSIS">
      <description>System Startup for NXP Kinetis K10D 100MHz devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source" name="Device/Source/ARM/startup_MK10D10.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MK10D10.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup K10F12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="K10F12 CMSIS">
      <description>System Startup for NXP Kinetis K10F 120MHz devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source" name="Device/Source/ARM/startup_MK10F12.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MK10F12.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup K11D5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="K11D5 CMSIS">
      <description>System Startup for NXP Kinetis K11D 50MHz devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source" name="Device/Source/ARM/startup_MK11D5.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MK11D5.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup K12D5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="K12D5 CMSIS">
      <description>System Startup for NXP Kinetis K12D 50MHz devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source" name="Device/Source/ARM/startup_MK12D5.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MK12D5.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup K11DA5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="K11DA5 CMSIS">
      <description>System Startup for NXP Kinetis K11DA 50MHz devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK11DA5.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK11DA5.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MK11DA5.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

  </components>
</package>
